Revit 2025 API
ConcreteSealantType Enumeration
 The enumerated type representing the permitted values for the asset property "ConcreteSealant" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ConcreteSealantType
Public Enumeration ConcreteSealantType
public enum class ConcreteSealantType
type ConcreteSealantType
Members
Member name | Value | Description
None | 0
Epoxy | 1
Acrylic | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace